use A_MyDataBase;

SELECT Покупатели.Покупатель, Покупатели.Номер_телефона[Номер телефона], Продажи.Код_товара[Код товара], Продажи.Количество, Продажи.Дата[Дата продажи]
		FROM Покупатели inner join Продажи 
		on Покупатели.Покупатель = Продажи.Покупатель


SELECT Покупатели.Покупатель, Покупатели.Номер_телефона[Номер телефона], Продажи.Код_товара[Код товара], Продажи.Количество, Продажи.Дата[Дата продажи]
		FROM Покупатели inner join Продажи 
		on Покупатели.Покупатель = Продажи.Покупатель
		and Продажи.Количество like '1'


SELECT	Покупатели.Покупатель,
		Покупатели.Номер_телефона[Номер телефона], 
		Продажи.Код_товара[Код товара], 
		Продажи.Дата[Дата продажи],
		CASE
			WHEN Продажи.Количество = 1 THEN 'Один'
			WHEN Продажи.Количество = 2 THEN 'Два'
			WHEN Продажи.Количество = 3 THEN 'Три'
			ELSE CAST(Продажи.Количество as VARCHAR)
		END AS [Количество]
		FROM Покупатели inner join Продажи
		on Покупатели.Покупатель = Продажи.Покупатель
		inner join Товары 
		on Товары.Код_товара = Продажи.Код_товара 


SELECT Покупатели.Покупатель, Покупатели.Номер_телефона[Номер телефона], isnull(Продажи.Код_товара, -1)[Код товара], isnull(Продажи.Количество, -1), isnull(Продажи.Дата, '0001-01-01')[Дата продажи] FROM 
	Покупатели left outer join Продажи
	on Покупатели.Покупатель = Продажи.Покупатель


SELECT Покупатели.Покупатель, Покупатели.Адрес, isnull(Продажи.Дата, '0001-01-01'), isnull(Продажи.Код_товара, -1), isnull(Продажи.Количество, -1)FROM 
	Покупатели full outer join Продажи
	on Покупатели.Покупатель = Продажи.Покупатель

SELECT Товары.Код_товара[Код товара],  Товары.Наименование_товара[Название товара], Товары.Цена, Продажи.Дата, Продажи.Покупатель FROM
	Товары right outer join Продажи
	on Товары.Код_товара = Продажи.Код_товара

SELECT * FROM
	Продажи cross join Товары
	where  Продажи.Код_товара = Товары.Код_товара